import React from 'react';

import ArrowForwardIosIcon from '@mui/icons-material/ArrowForwardIos';

import './contactPage.scss';

const ContactsPage = () => {
    return (
        <section className='contacts'>
            <div className="container">
                <article className='section__title'>
                    <article className='navPanel'>
                        <p>Главная</p>
                        <ArrowForwardIosIcon />
                        <p className='greyName'>Контакты</p>
                    </article>
                    <h2 className='sectionName'>Контакты</h2>
                </article>
                <div className='topItemsWrapper'>
                    <div className="item">
                        <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M14.6163 2.00665C14.842 1.83112 15.158 1.83112 15.3837 2.00665L26.6337 10.7567C26.786 10.8751 26.875 11.0571 26.875 11.25V25C26.875 26.7259 25.4759 28.125 23.75 28.125H6.25C4.52411 28.125 3.125 26.7259 3.125 25V11.25C3.125 11.0571 3.21405 10.8751 3.36629 10.7567L14.6163 2.00665ZM4.375 11.5557V25C4.375 26.0355 5.21447 26.875 6.25 26.875H23.75C24.7855 26.875 25.625 26.0355 25.625 25V11.5557L15 3.29179L4.375 11.5557Z" fill="#414141" />
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M10.625 15C10.625 14.6548 10.9048 14.375 11.25 14.375H18.75C19.0952 14.375 19.375 14.6548 19.375 15V27.5C19.375 27.8452 19.0952 28.125 18.75 28.125C18.4048 28.125 18.125 27.8452 18.125 27.5V15.625H11.875V27.5C11.875 27.8452 11.5952 28.125 11.25 28.125C10.9048 28.125 10.625 27.8452 10.625 27.5V15Z" fill="#414141" />
                        </svg>
                        <p>Бухгалтерия, склад</p>
                        <p className='phone'>+7 82140 92619</p>
                    </div>
                    <div className="item">
                        <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M24.1919 5.80806C24.436 6.05214 24.436 6.44786 24.1919 6.69194L6.69194 24.1919C6.44786 24.436 6.05214 24.436 5.80806 24.1919C5.56398 23.9479 5.56398 23.5521 5.80806 23.3081L23.3081 5.80806C23.5521 5.56398 23.9479 5.56398 24.1919 5.80806Z" fill="#414141" />
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M4.375 8.125C4.375 6.05393 6.05393 4.375 8.125 4.375C10.1961 4.375 11.875 6.05393 11.875 8.125C11.875 10.1961 10.1961 11.875 8.125 11.875C6.05393 11.875 4.375 10.1961 4.375 8.125ZM8.125 5.625C6.74429 5.625 5.625 6.74429 5.625 8.125C5.625 9.50571 6.74429 10.625 8.125 10.625C9.50571 10.625 10.625 9.50571 10.625 8.125C10.625 6.74429 9.50571 5.625 8.125 5.625Z" fill="#414141" />
                            <path fill-rule="evenodd" clip-rule="evenodd" d="M18.125 21.875C18.125 19.8039 19.8039 18.125 21.875 18.125C23.9461 18.125 25.625 19.8039 25.625 21.875C25.625 23.9461 23.9461 25.625 21.875 25.625C19.8039 25.625 18.125 23.9461 18.125 21.875ZM21.875 19.375C20.4943 19.375 19.375 20.4943 19.375 21.875C19.375 23.2557 20.4943 24.375 21.875 24.375C23.2557 24.375 24.375 23.2557 24.375 21.875C24.375 20.4943 23.2557 19.375 21.875 19.375Z" fill="#414141" />
                        </svg>
                        <p>Вопросы по системе лояльности</p>
                        <p className='phone'>+7 82140 92619</p>
                    </div>
                </div>
                <div className='branchWrapper'>
                    <h2 className='branchName'>Наши магазины</h2>
                    <div className='towns'>
                        <button >п.Щельяюр</button>
                        <button>д.Вертеп</button>
                        <button>с.Краснобор</button>
                        <button>д.Диюр</button>
                    </div>
                    <div className="itemWrapper">
                        <div className="item">
                            <h3 className='item__title'>Восход</h3>
                            <div className='item__home'>
                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M14.6163 2.00665C14.842 1.83112 15.158 1.83112 15.3837 2.00665L26.6337 10.7567C26.786 10.8751 26.875 11.0571 26.875 11.25V25C26.875 26.7259 25.4759 28.125 23.75 28.125H6.25C4.52411 28.125 3.125 26.7259 3.125 25V11.25C3.125 11.0571 3.21405 10.8751 3.36629 10.7567L14.6163 2.00665ZM4.375 11.5557V25C4.375 26.0355 5.21447 26.875 6.25 26.875H23.75C24.7855 26.875 25.625 26.0355 25.625 25V11.5557L15 3.29179L4.375 11.5557Z" fill="#414141" />
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M10.625 15C10.625 14.6548 10.9048 14.375 11.25 14.375H18.75C19.0952 14.375 19.375 14.6548 19.375 15V27.5C19.375 27.8452 19.0952 28.125 18.75 28.125C18.4048 28.125 18.125 27.8452 18.125 27.5V15.625H11.875V27.5C11.875 27.8452 11.5952 28.125 11.25 28.125C10.9048 28.125 10.625 27.8452 10.625 27.5V15Z" fill="#414141" />
                                </svg>
                                <p className='house'>
                                    ул. Дорожная 10
                                </p>
                            </div>
                            <div className='item__phone'>
                                <svg width="30" height="30" viewBox="0 0 30 30" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M24.1919 5.80806C24.436 6.05214 24.436 6.44786 24.1919 6.69194L6.69194 24.1919C6.44786 24.436 6.05214 24.436 5.80806 24.1919C5.56398 23.9479 5.56398 23.5521 5.80806 23.3081L23.3081 5.80806C23.5521 5.56398 23.9479 5.56398 24.1919 5.80806Z" fill="#414141" />
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M4.375 8.125C4.375 6.05393 6.05393 4.375 8.125 4.375C10.1961 4.375 11.875 6.05393 11.875 8.125C11.875 10.1961 10.1961 11.875 8.125 11.875C6.05393 11.875 4.375 10.1961 4.375 8.125ZM8.125 5.625C6.74429 5.625 5.625 6.74429 5.625 8.125C5.625 9.50571 6.74429 10.625 8.125 10.625C9.50571 10.625 10.625 9.50571 10.625 8.125C10.625 6.74429 9.50571 5.625 8.125 5.625Z" fill="#414141" />
                                    <path fill-rule="evenodd" clip-rule="evenodd" d="M18.125 21.875C18.125 19.8039 19.8039 18.125 21.875 18.125C23.9461 18.125 25.625 19.8039 25.625 21.875C25.625 23.9461 23.9461 25.625 21.875 25.625C19.8039 25.625 18.125 23.9461 18.125 21.875ZM21.875 19.375C20.4943 19.375 19.375 20.4943 19.375 21.875C19.375 23.2557 20.4943 24.375 21.875 24.375C23.2557 24.375 24.375 23.2557 24.375 21.875C24.375 20.4943 23.2557 19.375 21.875 19.375Z" fill="#414141" />
                                </svg>
                                <p className='phone'>
                                    +7 904 271 35 90
                                </p>
                            </div>
                        </div>
                    </div>
                    <div className='map'>
                        <img src="/image/image 12.png" alt="" />
                    </div>
                </div>
            </div>
        </section>
    );
};

export default ContactsPage;